#include<stdio.h>
//1.
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次。
//
//int main()
//{
//	int A, B, C, D, E;
//	for (A = 1; A <= 5; A++)
//	{
//		for (B = 1; B <= 5; B++)
//			for (C = 1; C <= 5; C++)
//				for (D = 1; D <= 5; D++)
//					for (E = 1; E <= 5; E++)
//					{	
//						if(A!=B&&A!=C&&A!=D&&A!=E&&B!=C&&B!=D&&B!=E&&C!=D&&C!=E&&D!=E)
//						if (((B == 2) + (A == 3) == 1) && ((B == 2) + (E == 4) == 1) && ((C == 1) + (D == 2) == 1) && ((C == 5) + (D == 3) == 1) && ((E == 4) + (A == 1) == 1))
//						{
//							printf("A=%d B=%d C=%d D=%d E=%d", A, B, C, D, E);
//							printf("\n");
//						}
//					}
//	}
//	return 0;
//}
//2.
//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
//嫌疑犯的一个。以下为4个嫌疑犯的供词。
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手。
//int main()
//{
//	char k;
//	for (k = 'a'; k <= 'd'; k++)
//	{
//		if ((k != 'a') + (k == 'c') + (k == 'd') + (k != 'd') == 3)
//			printf("杀手是%c", k);
//	}
//	return 0;
//}
//打印杨辉三角。
int main()
{
	int i, j, k=1,h,d;
	int c[100]={0};
	int a[100] = { 0 };
	scanf_s("%d", &h);
	for (i = 0; i < h; i++)//控制行数
	{
		for (j = 0; j <=i ; j++)//控制列数
		{
			c[i] = 1; c[0] = 1;
			a[i] = 1; a[0] = 1;
			if (j != 0 && j != i)
			{
				printf("%d ", c[j-1]+c[j]);
				a[j] = c[j - 1] + c[j];
			}
			else
			{
				printf("%d ",c[0]);
			}	
		}
		for (d = 0; d < 100; d++)
		{
			c[d] = a[d];
		}
		printf("\n");
	}
		

	return 0;
}